erpdev.СХК_Расширение/src/DataProcessors/ОбработкаЯчеек/ОбработкаЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаЯчеек</name>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/Enums/СХК_ВМестимость/СХК_ВМестимость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СХК_ВМестимость</name>
  <enumValues>
    <name>Палет</name>
  </enumValues>
  <enumValues>
    <name>Сборный</name>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Catalogs/СХК_СкладЯчейки/СХК_СкладЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СХК_СкладЯчейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМестимость</name>
    <type>
      <types>EnumRef.СХК_ВМестимость</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/DataProcessors/ОбработкаЯчеек/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьШКНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_СкладЯчейки.Ссылка КАК Ссылка,
	               |	СХК_СкладЯчейки.ВМестимость КАК ВМестимость
	               |ИЗ
	               |	Справочник.СХК_СкладЯчейки КАК СХК_СкладЯчейки
	               |ГДЕ
	               |	СХК_СкладЯчейки.ПометкаУдаления = &ПометкаУдаления";  
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		оСпр = Рез.Ссылка.ПолучитьОбъект();  
		оСпр.ВМестимость = Перечисления.СХК_ВМестимость.Сборный;  
		Если СтрДлина(оСпр.ШтрихКод)<=5 Тогда
			ШК = СформироватьШК(оСпр.Код);
			оСпр.ШтрихКод = ШК;
		КонецЕсли;
		
		
		оСпр.Записать();	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьШК(Команда)
	ЗаполнитьШКНаСервере();
КонецПроцедуры


&НаСервере
Функция СформироватьШК(Код)
	ПрефиксУзлаШтрихкода = ПрефиксУзлаШтрихкода();
	
	Возврат ПолучитьШтрихкодПоКоду(Код, Код, ПрефиксУзлаШтрихкода);

КонецФункции

Функция ПолучитьШтрихкодПоКоду(Код, Диапазон, ПрефиксУзлаШтрихкода) Экспорт

	Штрихкод = Строка(Диапазон) + ПрефиксУзлаШтрихкода + Формат(Код, "ЧЦ=9; ЧВН=; ЧГ=");
	Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);

	Возврат Штрихкод;

КонецФункции   

Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт

	Четн   = 0;
	Нечетн = 0;

	КоличествоИтераций = ?(Тип = 13, 6, 4);

	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) И (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;

	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;

	КонтЦифра = 10 - (Четн + Нечетн) % 10;

	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));

КонецФункции  

Функция ПрефиксУзлаШтрихкода() Экспорт
	
	Возврат Формат(Константы.ПрефиксШтрихкодовУзлаРИБ.Получить(),"ЧЦ=1; ЧН=; ЧВН=");
	
КонецФункции

&НаСервере
Функция ПечатьШКНаСервере()
	ТаблДокум = Новый  ТабличныйДокумент;
    ТаблДокум.Очистить();
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");  
	Строка = Макет.ПолучитьОбласть("Строка");
	
		ШК = ПолучитьСЗШК(ЭтаФорма.Ряд);
		Для Каждого стр из ШК Цикл
			Строка.Параметры.Ячейка	 =   "Ряд " + СокрЛП(стр.Ряд)+ Символы.ПС + 
										 СокрЛП(стр.Ячейка)+ Символы.ПС + 
										 СокрЛП(стр.Секция);
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          112);
			ПараметрыШтрихкода.Вставить("Высота",          75);
			ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(стр.ШтрихКод));
			ПараметрыШтрихкода.Вставить("ТипКода",         2); // EAN13
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    16);
			                     
			Строка.Рисунки.ШтрихКод.Картинка= МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода); 
	        ТаблДокум.АвтоМасштаб = Истина;
			ТаблДокум.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;   
			ТаблДокум.ВысотаСтраницы = "70";
			ТаблДокум.ШиринаСтраницы = "100";
			
			ТаблДокум.Вывести(Строка); 
			ТаблДокум.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;
		
	
	Возврат ТаблДокум;

КонецФункции

&НаСервере
Функция ПолучитьСЗШК(Ряд)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	СХК_СкладЯчейки.Ряд КАК Ряд,
		|	СХК_СкладЯчейки.Ячейка КАК Ячейка,
		|	СХК_СкладЯчейки.Секция КАК Секция ,СХК_СкладЯчейки.ШтрихКод КАК ШтрихКод
		|ИЗ
		|	Справочник.СХК_СкладЯчейки КАК СХК_СкладЯчейки   
		|ГДЕ
		|	СХК_СкладЯчейки.Ряд = &Ряд    И СХК_СкладЯчейки.ПометкаУдаления = &ПометкаУдаления

		|
		|УПОРЯДОЧИТЬ ПО
		|	Ячейка,
		|	СХК_СкладЯчейки.Секция";
	
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	Запрос.УстановитьПараметр("Ряд",Ряд);
	
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода); 
	
	Возврат ТабЗнач;	

КонецФункции
	
&НаКлиенте
Процедура ПечатьШК(Команда)
			ТаблДокум = ПечатьШКНаСервере();
		ТаблДокум.Показать("Печать документа");
КонецПроцедуры
